In [2]:
import pandas as pd
import numpy as np

In [3]:
s=pd.Series([1,2,3,4, np.nan, 6,7])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    6.0
6    7.0
dtype: float64

In [4]:
dates=pd.date_range("20170211", periods=6)
dates

DatetimeIndex(['2017-02-11', '2017-02-12', '2017-02-13', '2017-02-14',
               '2017-02-15', '2017-02-16'],
              dtype='datetime64[ns]', freq='D')

In [5]:
np.random.randn(6,4)

array([[-0.18817419, -0.860146  ,  2.19053599,  0.6989705 ],
       [-0.33160975,  0.83589946,  0.87877657,  2.22520291],
       [-0.02598572,  0.24738324, -1.12402644,  0.34489257],
       [ 0.51380997,  0.23308453, -1.46807738,  0.17132913],
       [-0.44888794,  1.21544945,  0.40050554, -0.24783369],
       [-0.29877405,  0.12418267,  0.18985822, -0.21931851]])

In [6]:
df=pd.DataFrame(np.random.randn(6,4), index= dates, columns=list('ABCD'))
df

                   A         B         C         D
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2017-02-13 -1.134155  0.844642  0.711454 -0.662289
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924 -0.031386
2017-02-16 -1.539337 -0.427017  0.140386  0.447909

Creating a DataFrame by passing a dictionary of objects where the keys are the column labels and the values are the column values.

In [7]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series((1,2,3,4), index=list(range(4)), dtype="int32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
2  1.0 2013-01-02  3  3   test  foo
3  1.0 2013-01-02  4  3  train  foo

In [8]:
df2.dtypes

A          float64
B    datetime64[s]
C            int32
D            int32
E         category
F           object
dtype: object

Viewing Data

In [9]:
df.head(2)

                   A         B         C         D
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-12  0.567258  0.396485 -0.367414 -0.415383

In [10]:
df.tail(3)

                   A         B         C         D
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924 -0.031386
2017-02-16 -1.539337 -0.427017  0.140386  0.447909

In [11]:
df.abs()

                   A         B         C         D
2017-02-11  1.322762  0.837302  0.754787  0.613189
2017-02-12  0.567258  0.396485  0.367414  0.415383
2017-02-13  1.134155  0.844642  0.711454  0.662289
2017-02-14  0.050964  1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924  0.031386
2017-02-16  1.539337  0.427017  0.140386  0.447909

In [12]:
df.index

DatetimeIndex(['2017-02-11', '2017-02-12', '2017-02-13', '2017-02-14',
               '2017-02-15', '2017-02-16'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.set_index('B')
df

                   A         B         C         D
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2017-02-13 -1.134155  0.844642  0.711454 -0.662289
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924 -0.031386
2017-02-16 -1.539337 -0.427017  0.140386  0.447909

In [14]:
df.reset_index()

       index         A         B         C         D
0 2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
1 2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2 2017-02-13 -1.134155  0.844642  0.711454 -0.662289
3 2017-02-14  0.050964 -1.247415  0.477835  0.325572
4 2017-02-15  0.441426  1.211993  0.303924 -0.031386
5 2017-02-16 -1.539337 -0.427017  0.140386  0.447909

In [15]:
df

                   A         B         C         D
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2017-02-13 -1.134155  0.844642  0.711454 -0.662289
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924 -0.031386
2017-02-16 -1.539337 -0.427017  0.140386  0.447909

In [16]:
df.to_numpy()

array([[-1.32276197, -0.83730187,  0.75478713, -0.61318887],
       [ 0.56725792,  0.39648524, -0.36741363, -0.41538261],
       [-1.13415497,  0.84464225,  0.71145439, -0.66228943],
       [ 0.05096358, -1.2474151 ,  0.4778348 ,  0.32557178],
       [ 0.44142554,  1.21199258,  0.30392432, -0.03138641],
       [-1.53933728, -0.4270168 ,  0.14038601,  0.4479094 ]])

NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 2, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 3, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 4, 3, 'train', 'foo']],
      dtype=object)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.489435 -0.009769  0.336829 -0.158128
std    0.947367  0.977593  0.417264  0.478487
min   -1.539337 -1.247415 -0.367414 -0.662289
25%   -1.275610 -0.734731  0.181271 -0.563737
50%   -0.541596 -0.015266  0.390880 -0.223385
75%    0.343810  0.732603  0.653049  0.236332
max    0.567258  1.211993  0.754787  0.447909

Transpose

In [19]:
df.T

   2017-02-11  2017-02-12  2017-02-13  2017-02-14  2017-02-15  2017-02-16
A   -1.322762    0.567258   -1.134155    0.050964    0.441426   -1.539337
B   -0.837302    0.396485    0.844642   -1.247415    1.211993   -0.427017
C    0.754787   -0.367414    0.711454    0.477835    0.303924    0.140386
D   -0.613189   -0.415383   -0.662289    0.325572   -0.031386    0.447909

In [20]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,2,3,4
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

Sort by an index

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2017-02-11 -0.613189  0.754787 -0.837302 -1.322762
2017-02-12 -0.415383 -0.367414  0.396485  0.567258
2017-02-13 -0.662289  0.711454  0.844642 -1.134155
2017-02-14  0.325572  0.477835 -1.247415  0.050964
2017-02-15 -0.031386  0.303924  1.211993  0.441426
2017-02-16  0.447909  0.140386 -0.427017 -1.539337

In [22]:
df.sort_values(by="B")

                   A         B         C         D
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-16 -1.539337 -0.427017  0.140386  0.447909
2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2017-02-13 -1.134155  0.844642  0.711454 -0.662289
2017-02-15  0.441426  1.211993  0.303924 -0.031386

## GetItem([])

In [23]:
df['A']

2017-02-11   -1.322762
2017-02-12    0.567258
2017-02-13   -1.134155
2017-02-14    0.050964
2017-02-15    0.441426
2017-02-16   -1.539337
Freq: D, Name: A, dtype: float64

In [24]:
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
2  1.0 2013-01-02  3  3   test  foo
3  1.0 2013-01-02  4  3  train  foo

In [25]:
df2[0:3]

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  2  3  train  foo
2  1.0 2013-01-02  3  3   test  foo

In [26]:
df

                   A         B         C         D
2017-02-11 -1.322762 -0.837302  0.754787 -0.613189
2017-02-12  0.567258  0.396485 -0.367414 -0.415383
2017-02-13 -1.134155  0.844642  0.711454 -0.662289
2017-02-14  0.050964 -1.247415  0.477835  0.325572
2017-02-15  0.441426  1.211993  0.303924 -0.031386
2017-02-16 -1.539337 -0.427017  0.140386  0.447909

# Selection by label

In [27]:
df.loc[dates[0]]

A   -1.322762
B   -0.837302
C    0.754787
D   -0.613189
Name: 2017-02-11 00:00:00, dtype: float64

Selecting all rows (:) with a select column labels:

In [28]:
df.loc[:,['A','B']]

                   A         B
2017-02-11 -1.322762 -0.837302
2017-02-12  0.567258  0.396485
2017-02-13 -1.134155  0.844642
2017-02-14  0.050964 -1.247415
2017-02-15  0.441426  1.211993
2017-02-16 -1.539337 -0.427017

In [29]:
df.loc['20170212':'20170214',['A','B']]

                   A         B
2017-02-12  0.567258  0.396485
2017-02-13 -1.134155  0.844642
2017-02-14  0.050964 -1.247415

In [30]:
df.loc[dates[0], ["A"]]

A   -1.322762
Name: 2017-02-11 00:00:00, dtype: float64

In [32]:
df.at[dates[0], 'A']

-1.3227619667113295